# GroupBy

In [3]:
import pandas as pd
var = pd.DataFrame({"name":['a', 'b', 'c', 'd', 'b', 'a', 'c','c', 'd'],
                    "s_1":[12, 13, 14,12, 14, 13, 11, 13, 15],
                    "s_2":[12, 12, 14, 13, 15, 16, 17, 18, 16]})

In [8]:
var1 = var.groupby('name') # This will group the values according to the name column in ascending order
for x, y in var1: # x will be the elements of the column respect to which they are grouped and y are the elements of each column
    print(x)
    print(y)

a
  name  s_1  s_2
0    a   12   12
5    a   13   16
b
  name  s_1  s_2
1    b   13   12
4    b   14   15
c
  name  s_1  s_2
2    c   14   14
6    c   11   17
7    c   13   18
d
  name  s_1  s_2
3    d   12   13
8    d   15   16

In [9]:
var1.get_group('a') # This will give the data of a in grouped elements

  name  s_1  s_2
0    a   12   12
5    a   13   16

In [10]:
var1.min() # This will the minimum data in each column of the grouped data according to how they are grouped

      s_1  s_2
name
a      12   12
b      13   12
c      11   14
d      12   13

In [11]:
var1.max() # it gives maximum data

      s_1  s_2
name
a      13   16
b      14   15
c      14   18
d      15   16

In [12]:
var1.mean() # To get mean of each grouped data

            s_1        s_2
name
a     12.500000  14.000000
b     13.500000  13.500000
c     12.666667  16.333333
d     13.500000  14.500000

In [17]:
li = list(var1) # Convert it to a list with tuple values
type(li[0])

tuple